/*
    MoeRand For TVTC 
	Powered by 晓空 & 岩浆块Magma
	感谢 岩浆块Magma、残页、胖橘猫总是饿 以及 Google、百度、CSDN提供的帮助
	Copyright 2012-2022 空梦世界 MoeWorld-CN Inc.
    https://github.com/KJZH001/MoeRander
*/

// 如果想要修改抽取的名单的话请修改这里的内容
// 引号和逗号请保证和原先的一致（英文半角符号）
//前面的每一行都在结尾有逗号，最后一行没有
const randList =
		[ 
			["假装这里有一堆名字2333","要抽的东西请写在这里","别看了，该写东西了","你今天摸鱼了嘛~"],
			["路人甲","路人乙","路人丁"],
			["涂山苏苏","亚丝娜","薄荷","喵羽雫","希儿","八重樱"]
		];

//名单列表
//如果你添加了一个新的名单，请修改此处的内容
//这里的每一项都对应上面的名单，请保证这里的名单名称的数量和名单个数一致
const nameList = ["randList","名单1","名单2"];

// 是否在控制台输出抽出的名字（不用管这里）
const showLog = false;